<?php
/**
 * Created by IntelliJ IDEA.
 * User: shinate
 * Date: 2017/10/17
 * Time: 下午11:13
 */

return [
    'ep'          => [
        [1, 'I', 'Episode: I'],
        [2, 'II', 'Episode: II'],
        [4, 'IV', 'Episode: IV'],
    ],
    'type'        => [
        'box',
        'mob',
    ],
    'dif'         => [
        ['Normal', '普通', 'N'],
        ['Hard', '困难', 'H'],
        ['Very Hard', '极难', 'V'],
        ['Ultimate', '极限', 'U'],
    ],
    'sec'         => [
        ['VIRIDIA', '铬绿', '#94ffbc'],
        ['GREENNILL', '翠绿', '#97ff94'],
        ['SKYLY', '天青', '#94fffe'],
        ['BLUEFULL', '纯蓝', '#94c9ff'],
        ['PURPLENUM', '淡紫', '#ba94ff'],
        ['PINKAL', '粉红', '#ff94d0'],
        ['REDRIA', '真红', '#ff9494'],
        ['ORAN', '橙黄', '#ffdd94'],
        ['YELLOWBOZE', '金黄', '#f9ff94'],
        ['WHITILL', '羽白', '#ffffff'],
    ],
    'area'        => [
        [
            [
                ['Forest', '森林'],
                [
                    1  => ['Forest 1', '森林一层'],
                    2  => ['Forest 2', '森林二层'],
                    11 => ['Dragon', '龙穴'],
                ],
            ],
            [
                ['Cave', '洞窟'],
                [
                    3  => ['Cave 1', '洞窟一层'],
                    4  => ['Cave 2', '洞窟二层'],
                    5  => ['Cave 3', '洞窟三层'],
                    12 => ['De Rol', 'BOSS区域'],
                ],
            ],
            [
                ['Mine', '坑道'],
                [
                    6  => ['Mine 1', '坑道一层'],
                    7  => ['Mine 2', '坑道二层'],
                    13 => ['Vol opt', 'BOSS区域'],
                ],
            ],
            [
                ['Ruins', '遗迹'],
                [
                    8  => ['Ruins 1', '遗迹一层'],
                    9  => ['Ruins 2', '遗迹二层'],
                    10 => ['Ruins 3', '遗迹三层'],
                    14 => ['Falz', '暗黑佛区域'],
                ],
            ],
            [
                ['Other', '其他'],
                [
                    0  => ['Pioneer 2', '先驱者2号'],
                    15 => ['Lobby 1', '大厅1'],
                ],
            ],
        ],
        [
            [
                ['Temple', '神殿'],
                [
                    1  => ['Temple alpha', '神殿α'],
                    2  => ['Temple beta', '神殿β'],
                    14 => ['Barba ray', 'BOSS区域'],
                ],
            ],
            [
                ['Space Ship', '宇宙船'],
                [
                    3  => ['Space Ship alpha', '宇宙船α'],
                    4  => ['Space Ship beta', '宇宙船β'],
                    15 => ['Gol dragon', '数码龙'],
                ],
            ],
            [
                ['CCA', '中央管理区'],
                [
                    5  => ['CCA', '中央管理区'],
                    6  => ['Jungel east', '雨林东部地区'],
                    7  => ['Jungel north', '雨林北部地区'],
                    8  => ['Mountains', '高山地区'],
                    9  => ['Seaside', '海岸地区'],
                    12 => ['Gal Gryphon', '加尔狮鹫地区'],
                ],
            ],
            [
                ['Seabed', '海底'],
                [
                    10 => ['Seabed upper', '海底上层'],
                    11 => ['Seabed lower', '海底下层'],
                    13 => ['Olga Flow', 'BOSS区域'],
                ],
            ],
            [
                ['Tower', '中央控制塔'],
                [
                    17 => ['Tower', '中央控制塔'],
                ],
            ],
        ],
        [
            [
                ['Wilds', '陨石坑'],
                [
                    1 => ['Wilds', '沙漠??'],
                    2 => ['Wilds', '沙漠??'],
                    3 => ['Wilds', '沙漠??'],
                    4 => ['Wilds', '沙漠??'],
                    5 => ['Crater', '陨石坑'],
                ],
            ],
            [
                ['Desert', '地下沙漠'],
                [
                    6 => ['Desert 1', '沙漠一层'],
                    7 => ['Desert 2', '沙漠二层'],
                    8 => ['Desert 3', '沙漠三层'],
                    9 => ['EP4 Boss', 'BOSS区域'],
                ],
            ],
        ],
    ],
    'stat_boosts' => [
        2  => [[7, 5]],
        3  => [[3, 10]],
        4  => [[7, 5], [11, 15]],
        5  => [[6, 10], [11, 15]],
        6  => [[11, 15]],
        7  => [[4, 10]],
        9  => [[4, 15]],
        10 => [[3, 5]],
        11 => [[7, 10]],
        12 => [[11, 30]],
        13 => [[7, 10], [11, 30]],
        14 => [[4, 20]],
        15 => [[5, 20]],
        16 => [[3, 15]],
        17 => [[8, 5]],
        18 => [[8, 10]],
        19 => [[11, 20]],
        20 => [[16, 10]],
        22 => [[2, 15]],
        23 => [[2, 20]],
        24 => [[1, 15]],
        25 => [[1, 35]],
        26 => [[1, 10], [2, 10]],
        27 => [[11, 5]],
        28 => [[11, 10]],
        29 => [[10, 10]],
        35 => [[4, 30]],
        36 => [[5, 35], [15, 10]],
        37 => [[8, 15]],
        38 => [[8, 20]],
        39 => [[3, 20]],
        40 => [[3, 25]],
        41 => [[3, 30]],
        42 => [[3, 35]],
        43 => [[3, 40]],
        44 => [[3, 45]],
        45 => [[3, 50]],
        46 => [[4, 5]],
        47 => [[4, 25]],
        48 => [[4, 35]],
        49 => [[4, 40]],
        50 => [[4, 45]],
        51 => [[4, 50]],
    ],
    'stat'        => [
        1  => ['ATP', '攻击', 1],
        2  => ['ATA', '命中', 1],
        3  => ['EVP', '回避', 1],
        4  => ['DFP', '防御', 1],
        5  => ['MST', '精神', 1],
        6  => ['HP', '生命', 1],
        7  => ['LUK', '运气', 1],
        8  => ['ALL', '全属性', 1],
        9  => ['ATP', '攻击', -1],
        10 => ['ATA', '命中', -1],
        11 => ['EVP', '回避', -1],
        12 => ['DFP', '防御', -1],
        13 => ['MST', '精神', -1],
        14 => ['HP', '生命', -1],
        15 => ['LUK', '运气', -1],
        16 => ['ALL', '全属性', -1],
    ],
    'ports'       => [
        '12000' => ['login', '登录服务器'],
        '11000' => ['patch', '更新服务器'],
        '5278'  => ['SHIP 1', '正式 船1'],
        '5378'  => ['SHIP Beta', '测试 船BETA'],
    ],
];